tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mas-cli/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git", link: false
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Improved top (interactive process viewer)
brew "htop"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Python dependency management tool
brew "pipenv"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
cask "flux"
cask "iterm2"
cask "java"
cask "spectacle"
cask "transmission"
cask "virtualbox"
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
